src/cf/src/Catalogs/ТелеграмОбработка/ТелеграмОбработка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТелеграмОбработка</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ТелеграмСтатусыИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчиститьКонтекст</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСборкиОтвета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбработки</name>
    <type>
      <types>EnumRef.ТелеграмТипыОбработок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействияНадКонтекстомАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДействияНадКонтекстом</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ТелеграмПараметрыКонтекста</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ТелеграмДействияСКонтекстом</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ТелеграмПараметрыКонтекста</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/ТелеграмСервис/ТелеграмСервис.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТелеграмСервис</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ТелеграмСтатусыИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>Бот</name>
    <type>
      <types>CatalogRef.ТелеграмБоты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВходящегоОбновления</name>
    <type>
      <types>EnumRef.ТелеграмВидыВходящихОбновлений</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийТекстАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборыУсловийАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкиАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВходящийТекст</name>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>EnumRef.ТелеграмВидыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВходящиеДанные</name>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>EnumRef.ТелеграмВидыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыУсловий</name>
    <attributes>
      <name>НаборУсловий</name>
      <type>
        <types>CatalogRef.ТелеграмНаборУсловий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обработки</name>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.ТелеграмОбработка</types>
      </type>
    </attributes>
    <attributes>
      <name>НаборУсловий</name>
      <type>
        <types>CatalogRef.ТелеграмНаборУсловий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/ТелеграмОбработка/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьТаблицуСервисы();
	
	// #РаскраскаКода
	РаскраситьПрограммныйКодHTML("КодСборкиОтвета", "КодСборкиОтветаHTML");

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// #РаскраскаКода
	Объект.КодСборкиОтвета = ОбщегоНазначенияКупоросКлиент.КодПрограммыИзРаскрашенногоHTML(Элементы.КодСборкиОтветаHTML);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьТаблицуСервисы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сообщение(Команда)
	
	ОткрытьФормуСозданияШаблона(НСтр("ru = 'Создание шаблона отправки сообщения'"), "sendMessage", "ОтправитьСообщение");
	
КонецПроцедуры

&НаКлиенте
Процедура Фото(Команда)
	
	ОткрытьФормуСозданияШаблона(НСтр("ru = 'Создание шаблона отправки фотографии'"), "sendPhoto", "ОтправитьФотографию");
	
КонецПроцедуры

&НаКлиенте
Процедура Видео(Команда)
	
	ОткрытьФормуСозданияШаблона(НСтр("ru = 'Создание шаблона отправки видео'"), "sendVideo", "ОтправитьВидео");
	
КонецПроцедуры

&НаКлиенте
Процедура Файл(Команда)
	
	ОткрытьФормуСозданияШаблона(НСтр("ru = 'Создание шаблона отправки файла'"), "sendDocument", "ОтправитьДокумент");
	
КонецПроцедуры

&НаКлиенте
Процедура Аудио(Команда)
	
	ОткрытьФормуСозданияШаблона(НСтр("ru = 'Создание шаблона отправки аудио'"), "sendAudio", "ОтправитьАудио");
	
КонецПроцедуры

&НаКлиенте
Процедура Голосовое(Команда)
	
	ОткрытьФормуСозданияШаблона(НСтр("ru = 'Создание шаблона отправки голосовой записи'"), "sendVoice", "ОтправитьГолос");
	
КонецПроцедуры

&НаКлиенте
Процедура Местоположение(Команда)
	
	ОткрытьФормуСозданияШаблона(НСтр("ru = 'Создание шаблона отправки местоположения'"), "sendLocation", "ОтправитьМестоположение");
	
КонецПроцедуры

&НаКлиенте
Процедура МестоНаКарте(Команда)
	
	ОткрытьФормуСозданияШаблона(НСтр("ru = 'Создание шаблона отправки места на карте'"), "sendVenue", "ОтправитьМестоНаКарте");
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьКонтекстнуюКлавиатуру(Команда)
	
	ОткрытьФормуСозданияШаблона(НСтр("ru = 'Редактирование контекстной клавиатуры'"), "editMessageReplyMarkup", "РедактироватьКонтекстнуюКлавиатуру");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	// #РаскраскаКода
	Объект.КодСборкиОтвета = ОбщегоНазначенияКупоросКлиент.КодПрограммыИзРаскрашенногоHTML(Элементы.КодСборкиОтветаHTML);
	
	ТекстМакета = НСтр("ru = '// Загружается двоичное содержимое сообщения, что бы это ни было - документ, картинка, аудио, видео, голос.
                        |// Файл сохраняется в папке, указанной в реквизите """"Каталог сохранения файлов"""" бота.
                        |// Результат загрузки попадает в НакопленныеДанные.ЗагруженныйФайл (<строка> Или НЕОПРЕДЕЛЕНО) 
                        |ЗагрузитьФайл(НакопленныеДанные);'");
	
	Если ЗначениеЗаполнено(Объект.КодСборкиОтвета) Тогда
		РазделительКода = Символы.ПС + Символы.ПС + Символы.ПС;
	Иначе
		РазделительКода = "";
	КонецЕсли;
	Объект.КодСборкиОтвета = Объект.КодСборкиОтвета + РазделительКода + ТекстМакета;
	
	// #РаскраскаКода
	РаскраситьПрограммныйКодHTML("КодСборкиОтвета", "КодСборкиОтветаHTML");
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСообщение(Команда)
	
	ОткрытьФормуСозданияШаблона(НСтр("ru = 'Редактирование отправленного ранее сообщения'"), "editMessageText", "ИзменитьТекстСообщения");
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСообщение(Команда)
	
	ОткрытьФормуСозданияШаблона(НСтр("ru = 'Удаление отправленного ранее сообщения'"), "deleteMessage", "УдалитьСообщение");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуСозданияШаблона(ЗаголовокФормы, Метод, НазваниеПроцедуры)
	
	// #РаскраскаКода
	Объект.КодСборкиОтвета = ОбщегоНазначенияКупоросКлиент.КодПрограммыИзРаскрашенногоHTML(Элементы.КодСборкиОтветаHTML);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Заголовок", 		ЗаголовокФормы);
	ПараметрыОткрытия.Вставить("Метод", 			Метод);
	ПараметрыОткрытия.Вставить("НазваниеПроцедуры", НазваниеПроцедуры);
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьКодВыбор", ЭтаФорма);
	ОткрытьФорму("Справочник.ТелеграмОбработка.Форма.ФормаСозданияШаблона", ПараметрыОткрытия, ЭтаФорма,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКодВыбор(ТекстМакета, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ТекстМакета) = Тип("Строка") Тогда
		
		Если ЗначениеЗаполнено(Объект.КодСборкиОтвета) Тогда
			РазделительКода = Символы.ПС + Символы.ПС + Символы.ПС;
		Иначе
			РазделительКода = "";
		КонецЕсли;
		Объект.КодСборкиОтвета = Объект.КодСборкиОтвета + РазделительКода + ТекстМакета;
		
		// #РаскраскаКода
		РаскраситьПрограммныйКодHTML("КодСборкиОтвета", "КодСборкиОтветаHTML");
		
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуСервисы()
	
	Сервисы.Очистить();
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Обработка", Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТелеграмСервисОбработки.Ссылка КАК Сервис
	|ИЗ
	|	Справочник.ТелеграмСервис.Обработки КАК ТелеграмСервисОбработки
	|ГДЕ
	|	ТелеграмСервисОбработки.Обработка = &Обработка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТелеграмСервисОбработки.Ссылка.Код";
	
	Сервисы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

// #РаскраскаКода
&НаСервере
Процедура РаскраситьПрограммныйКодHTML(РеквизитОбъекта, РаскрашиваемыйРеквизитФормыHTML)

	ОбъектВыполняторКода = Обработки.ВыполняторКода.Создать();
	ЭтаФорма[РаскрашиваемыйРеквизитФормыHTML] = ОбъектВыполняторКода.РаскрашеннаяСтраница1C(Объект[РеквизитОбъекта]);

КонецПроцедуры

#КонецОбласти
